[metadata]
creation_date = "2023/04/03"
min_stack_version = "8.5.0"
maturity = "production"
updated_date = "2023/04/03"

[rule]
name = "[Custom] Create persistence: Modidy StartupFolder"
author = ["Andrey Krasnov"]
description = """
This rule will generate an alert when the Common Startup or Startup keys is changed (added) by Sysmon 13 or WinEventLog 4657.
"""
from = "now-5m"
index = ["winlogbeat-*", "logs-system.*", "logs-windows.*"]
language = "eql"
license = ""
note = """

"""
references = [
    "https://attack.mitre.org/techniques/T1547/001/"
]
risk_score = 47
rule_id = "8a2af66b-07af-419e-88fb-1b72842cbd96"
severity = "medium"
tags = ["Windows", "Threat Detection", "Persistence", "TA0003", "Boot or Logon Autostart Execution", "T1547", "Registry Run Keys / Startup Folder", "T1547.001", "Registry", "StartupFolder", "Modify"]
type = "eql"

query = '''
registry where (
	/*	WinEventLog 4657	*/
	event.provider: "Microsoft-Windows-Security-Auditing" and event.code: "4657" and winlog.event_data.ObjectName like~ ("*\\User Shell Folders*", "*\\Shell Folders*") and winlog.event_data.ObjectValueName in~ ("Common Startup","Startup")
	)
	or (
	/*	Sysmon 13		*/
	event.provider: "Microsoft-Windows-Sysmon" and event.code: "13" and registry.path like~ ("*\\User Shell Folders*", "*\\Shell Folders*") and registry.value in~ ("Common Startup","Startup")
	)
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1547"
name = "Boot or Logon Autostart Execution"
reference = "https://attack.mitre.org/techniques/T1547/"

[[rule.threat.technique.subtechnique]]
id = "T1547.001"
name = "Registry Run Keys / Startup Folder"
reference = "https://attack.mitre.org/techniques/T1547/001/"

[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"